app/Controllers/AnalisisController.php

    public function index(): string
    {
        $AnalisisModel = model('AnalisisModel');
        $data['analisis'] = $AnalisisModel->findAll();
---
SELECT *
FROM `analisis`
WHERE `analisis`.`deleted_at` IS NULL