app/Controllers/MarcaController.php

    public function show(){
        $MarcaM = model('MarcaModel');
        $data['marcas'] = $MarcaM->findAll();
---
SELECT *
FROM `Marca`