app/Models/ProductosModel.php

    public function getDetalle($IdProducto){
        $db      = db_connect();
        $builder = $db->table('PRProducto')
                    ->select('*')
                    ->where('IdProducto',$IdProducto);

        $query = $builder->get();
---
SELECT *
FROM `PRProducto`
WHERE `IdProducto` = '20'